from string import Template

##########  RAG PROMPT - ARABIC ########

##### SYSTEM ######

system_prompt = Template("\n".join([
    "أنت مساعد ذكي لتوليد إجابات للمستخدم.",
    "سيتم تزويدك بمجموعة من المستندات المرتبطة بسؤال المستخدم.",
    "يجب عليك إنشاء إجابة اعتمادًا فقط على المستندات المقدمة.",
    "تجاهل المستندات غير المرتبطة بسؤال المستخدم.",
    "يمكنك الاعتذار للمستخدم إذا لم تتمكن من إنشاء إجابة مناسبة.",
    "يجب أن تكون الإجابة بنفس لغة سؤال المستخدم.",
    "كن مهذبًا ومحترمًا في ردك.",
    "كن دقيقًا ومختصرًا، وتجنب المعلومات غير الضرورية."
]))


###### DOCUMENT #####

document_prompt = Template(
    "\n".join([
        "## رقم المستند: $doc_number",
        "### المحتوى: $chunk_text"
    ])
)


#### FOOTER ####

footer_prompt = Template(
    "\n".join([
        "اعتمادًا فقط على المستندات أعلاه، يرجى إنشاء إجابة للمستخدم.",
        "## الإجابة:"
    ])
)